; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v6 ?v7)
             (pred_9 ?v12 ?v5)
             (pred_6 ?v6 ?v5)
             (pred_7 ?v10 ?v6 )
	     (pred_4 ?v6)
             (pred_11 ?v9)
             (pred_10 ?v12)
             (pred_3 ?v5)
             (pred_5 ?v6)
             (pred_1 ?v12)
             (pred_8 ?v6)
             (pred_12 ))



(:action op_3
:parameters (?v4 ?v8 ?v13 ?v3)
:precondition (and (pred_11 ?v4) (pred_11 ?v8) (pred_10 ?v13) (pred_3 ?v3)
          (pred_2 ?v4 ?v8) (pred_9 ?v13 ?v3)
                   (pred_6 ?v8 ?v3) (pred_4 ?v4) 
                   (pred_5 ?v8) (pred_1 ?v13))
:effect (and  (pred_8 ?v8) (not (pred_5 ?v8))))


(:action op_2
:parameters (?v4 ?v11)
:precondition (and (pred_11 ?v4) (pred_11 ?v11)
               (pred_4 ?v4) (pred_2 ?v4 ?v11) (pred_8 ?v11))
:effect (and (pred_4 ?v11) (not (pred_4 ?v4))))

(:action op_1
:parameters (?v4 ?v13)
:precondition (and (pred_11 ?v4) (pred_10 ?v13) 
                  (pred_4 ?v4) (pred_7 ?v13 ?v4) (pred_12 ))
:effect (and (pred_1 ?v13)
   (not (pred_7 ?v13 ?v4)) (not (pred_12 ))))


(:action op_4
:parameters (?v4 ?v2 ?v1)
:precondition (and (pred_11 ?v4) (pred_10 ?v2) (pred_10 ?v1)
                  (pred_4 ?v4) (pred_1 ?v1) (pred_7 ?v2 ?v4))
:effect (and (pred_1 ?v2) (pred_7 ?v1 ?v4)
        (not (pred_1 ?v1)) (not (pred_7 ?v2 ?v4))))

(:action op_5
:parameters (?v4 ?v13)
:precondition (and (pred_11 ?v4) (pred_10 ?v13) 
                  (pred_4 ?v4) (pred_1 ?v13))
:effect (and (pred_12 ) (pred_7 ?v13 ?v4) (not (pred_1 ?v13)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_14 obj_08 obj_04 obj_07 obj_17 obj_05 obj_11 obj_09 obj_06 obj_10 obj_15 obj_03 obj_13 obj_01 obj_18 obj_12
    obj_20 obj_19
    obj_02 obj_16
    )

    (:init
       (pred_12)

       (pred_11 obj_14)
       (pred_11 obj_08)
       (pred_11 obj_04)
       (pred_11 obj_07)
       (pred_11 obj_17)
       (pred_11 obj_05)
       (pred_11 obj_11)
       (pred_11 obj_09)
       (pred_11 obj_06)
       (pred_11 obj_10)
       (pred_11 obj_15)
       (pred_11 obj_03)
       (pred_11 obj_13)
       (pred_11 obj_01)
       (pred_11 obj_18)
       (pred_11 obj_12)
       (pred_3 obj_20)
       (pred_3 obj_19)
       (pred_10 obj_02)
       (pred_10 obj_16)

       (pred_2 obj_14 obj_17)
       (pred_2 obj_14 obj_08)
       (pred_2 obj_08 obj_05)
       (pred_2 obj_08 obj_04)
       (pred_2 obj_08 obj_14)
       (pred_2 obj_04 obj_11)
       (pred_2 obj_04 obj_07)
       (pred_2 obj_04 obj_08)
       (pred_2 obj_07 obj_09)
       (pred_2 obj_07 obj_04)
       (pred_2 obj_17 obj_06)
       (pred_2 obj_17 obj_05)
       (pred_2 obj_17 obj_14)
       (pred_2 obj_05 obj_10)
       (pred_2 obj_05 obj_11)
       (pred_2 obj_05 obj_08)
       (pred_2 obj_05 obj_17)
       (pred_2 obj_11 obj_15)
       (pred_2 obj_11 obj_09)
       (pred_2 obj_11 obj_04)
       (pred_2 obj_11 obj_05)
       (pred_2 obj_09 obj_03)
       (pred_2 obj_09 obj_07)
       (pred_2 obj_09 obj_11)
       (pred_2 obj_06 obj_13)
       (pred_2 obj_06 obj_10)
       (pred_2 obj_06 obj_17)
       (pred_2 obj_10 obj_01)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_10 obj_05)
       (pred_2 obj_10 obj_06)
       (pred_2 obj_15 obj_18)
       (pred_2 obj_15 obj_03)
       (pred_2 obj_15 obj_11)
       (pred_2 obj_15 obj_10)
       (pred_2 obj_03 obj_12)
       (pred_2 obj_03 obj_09)
       (pred_2 obj_03 obj_15)
       (pred_2 obj_13 obj_01)
       (pred_2 obj_13 obj_06)
       (pred_2 obj_01 obj_18)
       (pred_2 obj_01 obj_10)
       (pred_2 obj_01 obj_13)
       (pred_2 obj_18 obj_12)
       (pred_2 obj_18 obj_15)
       (pred_2 obj_18 obj_01)
       (pred_2 obj_12 obj_03)
       (pred_2 obj_12 obj_18)
       (pred_5 obj_05)
       (pred_5 obj_11)
       (pred_6  obj_05 obj_20)
       (pred_6  obj_11 obj_19)
       (pred_8 obj_14)
       (pred_8 obj_08)
       (pred_8 obj_04)
       (pred_8 obj_07)
       (pred_8 obj_17)
       (pred_8 obj_09)
       (pred_8 obj_06)
       (pred_8 obj_10)
       (pred_8 obj_15)
       (pred_8 obj_03)
       (pred_8 obj_13)
       (pred_8 obj_01)
       (pred_8 obj_18)
       (pred_8 obj_12)

       (pred_9  obj_02 obj_20)
       (pred_9  obj_16 obj_19)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_16 obj_04)
       (pred_4 obj_03)
    )

    (:goal (and
       (pred_7 obj_16 obj_18)
    ))
(:constraints
  (always (not (pred_4 obj_11)))
)
)

; plan
1. (op_2 obj_03 obj_09)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_09)
   goals met: 0 of 1
2. (op_2 obj_09 obj_07)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_07)
   goals met: 0 of 1
3. (op_2 obj_07 obj_04)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_04)
   goals met: 0 of 1
4. (op_1 obj_04 obj_16)
   deleted: (pred_7 obj_16 obj_04) (pred_12)
   added: (pred_1 obj_16)
   goals met: 0 of 1
5. (op_2 obj_04 obj_07)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_07)
   goals met: 0 of 1
6. (op_2 obj_07 obj_09)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_09)
   goals met: 0 of 1
7. (op_2 obj_09 obj_03)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_03)
   goals met: 0 of 1
8. (op_2 obj_03 obj_15)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_15)
   goals met: 0 of 1
9. (op_2 obj_15 obj_18)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_18)
   goals met: 0 of 1
10. (op_5 obj_18 obj_16)
   deleted: (pred_1 obj_16)
   added: (pred_12) (pred_7 obj_16 obj_18)
   goals met: 1 of 1
